package com.gh.minawebsocket.bean;
/**
 *  帧接口
 *  @author chao
 *  2017-10-27
 *  
 * 	0                   1                   2                   3
 *  0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
 *  0 1 2 3 4 5 6 7 0 1 2 3 4 5 6 7 0 1 2 3 4 5 6 7 0 1 2 3 4 5 6 7 
 * +-+-+-+-+-------+-+-------------+-------------------------------+
 * |F|R|R|R| opcode|M| Payload len | Extended payload length       |
 * |I|S|S|S|  (4)  |A|     (7)     |         (16/64)               |
 * |N|V|V|V|       |S|			   |  (if payload len = 126/127)   |
 * | |1|2|3|       |K|             |                               |
 * +-+-+-+-+-------+-+-------------+===============================+
 * |					payload len(64bit) 	   	                   |
 * +===============================================================+
 * |       payload len(64bit)      | Masking-key,if MASK set to 1  |
 * +===============================+-------------------------------+
 * |    Masking-key(continued)     |         Payload Data          |
 * +-------------------------------+-------------------------------+
 * |                  PayLoad Data continued                       |
 * +-------------------------------+-------------------------------+
 * |                  PayLoad Data continued                       |
 * +-------------------------------+-------------------------------+
 * 
 * 解释：
 * 
 * FIN：
 * 标识是否为此消息的最后一个数据包，占1bit
 * 
 * RSV1, RSV2, RSV3: 
 * 用于扩展协议，一般为0，各占1bit
 * 
 * Opcode：
 * 数据包类型（frame type），占4bits
 * 0x0：标识一个中间数据包
 * 0x1：标识一个text类型数据包
 * 0x2：标识一个binary类型数据包
 * 0x3-7：保留
 * 0x8：标识一个断开连接类型数据包
 * 0x9：标识一个ping类型数据包
 * 0xA：表示一个pong类型数据包
 * 0xB-F：保留
 * 
 * MASK：
 * 占1bits，用于标识PayloadData是否经过掩码处理。如果是1，Masking-key域的数据即是掩码密钥，用于解码PayloadData。客户端发出的数据帧需要进行掩码处理，所以此位是1。
 * 
 * Payload length：
 * Payload data的长度，占7bits，7+16bits，7+64bits：
 * 如果其值在0-125，则是payload的真实长度。
 * 如果值是126，则后面2个字节形成的16bits无符号整型数的值是payload的真实长度。注意，网络字节序，需要转换。
 * 如果值是127，则后面8个字节形成的64bits无符号整型数的值是payload的真实长度。注意，网络字节序，需要转换。
 * 这里的长度表示遵循一个原则，用最少的字节表示长度（尽量减少不必要的传输）。
 * 举例说，payload真实长度是124，在0-125之间，必须用前7位表示；不允许长度1是126或127，然后长度2是124，这样违反原则。
 * 
 * Payload data：
 * 应用层数据
 * 
 * server解析client端的数据
 * 接收到客户端数据后的解析规则如下：
 */
public interface BasicFrame {
	 
}
